---
layout: single
status: publish
published: true
title: Webware
author:
  display_name: lpicanco
  login: lpicanco
  email: lpicanco@gmail.com
  url: ''
author_login: lpicanco
author_email: lpicanco@gmail.com
wordpress_id: 22
wordpress_url: http://www.luizantonio.com/blog/2006/10/27/webware/
date: '2006-10-27 22:59:59 -0300'
date_gmt: '2006-10-28 01:59:59 -0300'
categories:
- Reflex&Atilde;?&Acirc;&pound;o
tags: []
comments:
- id: 198
  author: indian gold jewelery
  author_email: Spendlove@ijmafjas.com
  author_url: http://www.indiantradeshows.com/2011/10/this-view-on-life-intended-for-from.html
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'ITPO, during its existence of nearly three decades, in the form of Trade
    Fair Authority of India and Trade Development Authority, has played a proactive
    role in Details on <a href="http://www.indiantradeshows.com" rel="nofollow">http://www.indiantradeshows.com</a> '
- id: 199
  author: Indira Facteau
  author_email: Yerkes4876@gmail.com
  author_url: http://www.care2.com/c2c/share/detail/3043058
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'Watch Alvin und die Chipmunks 3 Online '
- id: 200
  author: baby bop toys
  author_email: Chernak@gmail.com
  author_url: http://webnet.essencerestaurants.com/index.php/member/12951/
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'Give a man a fish and he will eat for a day. Teach him how to fish and
    he will sitin a boat and drink beer all day. '
- id: 440
  author: MAC 150 Large Powder Brush 8.5 Inches
  author_email: ''
  author_url: http://www.cocoashak.com/mac-150-large-powder-brush-85-inches-p-105.html
  date: '2015-06-17 07:50:12 -0300'
  date_gmt: '2015-06-17 10:50:12 -0300'
  content: |-
    <strong>MAC 150 Large Powder Brush 8.5 Inches</strong>

    I am really inspired together with your writing abilities and also with the structure on your blog. Is that this a paid subject matter or did you modify it your self? Either way keep up the excellent quality writing, it is uncommon to see a nice weblog&#8230;
- id: 492
  author: Cams Free
  author_email: ''
  author_url: http://citizenhistorian.com/2009/02/06/a-brief-hiatus/
  date: '2015-09-11 20:32:23 -0300'
  date_gmt: '2015-09-11 23:32:23 -0300'
  content: |-
    <strong>Great information</strong>

    This is marvelous. A good watch exactly that comfort therefore we are impressed. We are most certainly attracted to this sort of facts. We appreciate your memo, and amount your time inside this. Please keep cutting. They may be somewhat valued strategi&#8230;
- id: 507
  author: free live sex cams
  author_email: ''
  author_url: http://blogs.scu.edu/psykes/photos/
  date: '2015-09-12 05:05:24 -0300'
  date_gmt: '2015-09-12 08:05:24 -0300'
  content: |-
    <strong>Great information</strong>

    This is impressive. Our store stare upon every group written content when we are wordless. We are attracted to this kind of jobs. The appreciate drinker s suggest, and profit the effort while in this. Please keep modifying. They may be unique powerful&#8230;
---
<p>Os programas desktops est&atilde;o em fase terminal.</p>
<p>Essa frase de impacto mostra, que as aplica&ccedil;&otilde;es web (webware), dominar&atilde;o a nova era da inform&aacute;tica. Ser&aacute; uma revolu&ccedil;&atilde;o t&atilde;o grande quanto a que ocorreu, quando Steve Jobs montou o seu Macintosh, absorvendo as tecnologias de interface com usu&aacute;rio que os engenheiros do instituto de pesquisa de Palo Alto, da Xerox estavam desenvolvendo. Mal sabiam os executivos da Xerox, o erro que eles estavam cometendo ao ignorar e zombar de algo chamado mouse.</p>
<p>Agora, iremos viver uma nova era, onde a computa&ccedil;&atilde;o ser&aacute; mundialmente distribu&iacute;da, com softwares rodando a partir de qualquer lugar do planeta. As novas aplica&ccedil;&otilde;es web 2.0 j&aacute; come&ccedil;aram a mostrar isso. S&oacute; falta agora, a consolida&ccedil;&atilde;o dos padr&otilde;es e o suporte aos dispositivos m&oacute;veis.</p>
<p>Todo e qualquer software estar&aacute; conectado &Atilde;?&Acirc;&nbsp; internet. O seu computador ser&aacute; composto de apenas um software: O browser.</p>
<p><img align="left" alt="Macintosh" title="Macintosh" src="http://www.etedeschi.ndirect.co.uk/museum/picts/SE30.jpg" /><br />
O Macintosh da Apple</p>
