---
layout: single
status: publish
published: true
title: 'Faz-me rir: Por que &Atilde;?&Acirc;&copy; t&Atilde;?&Acirc;&pound;o dif&Atilde;?&Acirc;&shy;cil
  encontrar bons programadores ?'
author:
  display_name: lpicanco
  login: lpicanco
  email: lpicanco@gmail.com
  url: ''
author_login: lpicanco
author_email: lpicanco@gmail.com
wordpress_id: 28
wordpress_url: http://www.luizantonio.com/blog/2006/11/24/faz-me-rir-por-que-e-tao-dificil-encontrar-bons-programadores/
date: '2006-11-24 09:53:42 -0200'
date_gmt: '2006-11-24 12:53:42 -0200'
categories:
- Ruby on Rails
tags: []
comments: []
---
<p>Vejam o "tosco" artigo que saiu na webinsider, escrito por Marcelo Okano. Porque ser&aacute; que tiraram o artigo do ar ?</p>
<p>--</p>
<table width="98%" cellspacing="0" cellpadding="0">
<tr>
<td class="itemHead"><span class="itemTitle">Por que &eacute; t&atilde;o dif&iacute;cil encontrar bons programadores</span></td>
</tr>
<tr>
<td class="itemInfo"></td>
</tr>
<tr>
<td>
<div class="itemBody">
<p align="justify">&Atilde;? um problema s&eacute;rio no mercado: programadores bons normalmente est&atilde;o empregados e a concorr&ecirc;ncia com as trocentas empresas de TI que est&atilde;o pipocando por a&iacute; fazem com este profissional seja realmente valorizado.</p>
<p align="justify">Formar programadores nem sempre &eacute; uma boa op&ccedil;&atilde;o, pois eles tendem a ir embora com o tempo, seduzidos pelo mercado. No entanto, mesclar bons programadores da empresa com programas de est&aacute;gio, renova&ccedil;&atilde;o constante e incentivos de curto e m&eacute;dio prazo pode ser uma boa op&ccedil;&atilde;o. O mercado de TI est&aacute; em franca expans&atilde;o no Brasil e a tend&ecirc;ncia &eacute; ficar cada vez dif&iacute;cil a tarefa de se achar desenvolvedores no mercado.</p>
<p align="justify"><strong>&Atilde;? bom ter programadores estagi&aacute;rios?</strong></p>
<p align="justify">&Atilde;? &oacute;timo quando voc&ecirc; tem programadores mais experientes dando tutoria a estagi&aacute;rios. Mas quando voc&ecirc; usa o estagi&aacute;rio como m&atilde;o de obra barata, est&aacute; dando um tiro no p&eacute;. Vai precisar ler meu <a href="http://webinsider.uol.com.br/index.php/2006/10/05/uma-abordagem-pratica-para-consertar-projetos-em-crise/">artigo sobre crises</a> se ficar se cercando de estagi&aacute;rios.</p>
<p align="justify"><strong>Qual a diferen&ccedil;a entre programador J&uacute;nior, Pleno e S&ecirc;nior na pr&aacute;tica?</strong></p>
<p align="justify"><strong>Programador J&uacute;nior</strong>. Recebe pouco, n&atilde;o tem experi&ecirc;ncia, precisa de acompanhamento e te complica em situa&ccedil;&otilde;es de crise ou estresse. Funciona bem mas sem o devido acompanhamento vai trazer problemas.</p>
<p align="justify"><strong>Programador Pleno</strong>. Recebe m&eacute;dio, experi&ecirc;ncia m&eacute;dia, n&atilde;o precisa de acompanhamento, costuma se enrolar em projetos grandes mas resolve na maioria da vezes. Ajuda em momentos de crise sem bem orientado, caso contr&aacute;rio, tem a tend&ecirc;ncia em assumir posicionamento defensivo.</p>
<p align="justify"><strong>Programador S&ecirc;nior.</strong> Recebe bem, voc&ecirc; acha que nunca precisa dele, mas em momentos de crise &eacute; o cara que salva a sua vida. Se voc&ecirc; nunca precisou de um cara bom, &eacute; porque nunca se meteu em encrencas.</p>
<p align="justify"><strong>O que usar? ASP, PHP, Cold Fusion, Java, ASP.net ou outras?</strong></p>
<p align="justify"><strong>ASP.</strong> F&aacute;cil de achar programadores, muito popular, curva de aprendizado baixa, pouca performance. Os projetos, quando crescem, tendem a ficar ruins por falta de meios de modulariza&ccedil;&atilde;o e as IDEs (softwares que ajudam na programa&ccedil;&atilde;o) n&atilde;o s&atilde;o muito poderosas. M&eacute;dia produtividade. &Atilde;? p&eacute;ssima para dar manuten&ccedil;&atilde;o mas &eacute; f&aacute;cil de achar quem fa&ccedil;a.</p>
<p align="justify"><strong>PHP</strong>. Tem programadores de sobra, muito popular, curva de aprendizado m&eacute;dia, m&eacute;dia performance. M&eacute;dia produtividade. M&eacute;dio para dar manuten&ccedil;&atilde;o pois tem uma estrutura mais inteligente que ASP (&eacute; Orientada a Objetos).</p>
<p align="justify"><strong>ASP.net.</strong> M&eacute;dio de se achar programadores, curva de aprendizado alta, alta performance. Quando utilizada por quem entende, a manuten&ccedil;&atilde;o &eacute; f&aacute;cil independente do tamanho do projeto. Boa produtividade. [Recomendada]</p>
<p align="justify"><strong>Cold Fusion.</strong> Muito boa, melhor que ASP, mas pior que ASP.NET, dif&iacute;cil de achar programadores e pouco popular. Esque&ccedil;a.</p>
<p align="justify"><strong>Java.</strong> Existem muitas formas diferentes de se programar para web usando Java com v&aacute;rios frameworks e tecnologias. O programador tem ser especialista no framework e tecnologia. Curva de aprendizado alta, boa performance, programador dif&iacute;cil de achar e caro, baixa produtividade comparada com as outras acima. Em outros ambientes (n&atilde;o web) &eacute; a melhor escolha na maioria das vezes.</p>
<p align="justify"><strong>Outras.</strong> Esque&ccedil;a as outras. N&atilde;o &eacute; interessante detalhar os motivos, mas passam pela curva de aprendizado, populariza&ccedil;&atilde;o e dificuldade achar profissionais.</p>
<p align="justify"><strong>Qual &eacute; o melhor lugar para se contratar um programador?</strong></p>
<p align="justify">No site da <a title=" (Este link abre uma nova janela!)" target="_blank" rel="externo" href="http://www.apinfo.com/">Apinfo</a>.</p>
<p align="justify"><strong>Qual &eacute; a forma mais eficiente para avaliar programadores? Como saber se ele &eacute; bom?</strong></p>
<p align="justify">Fa&ccedil;a um teste pr&aacute;tico, voc&ecirc; ficar&aacute; surpreso com a falta de conhecimento das pessoas em quest&otilde;es b&aacute;sicas mesmo que elas afirmem no curr&iacute;culo que s&atilde;o especialistas. Avalie junto com uma pessoa t&eacute;cnica.</p>
<p align="justify">Procure coer&ecirc;ncia entre conhecimento e experi&ecirc;ncia. Pergunte no que ela &eacute; boa e n&atilde;o se iluda com siglas. Quanto mais siglas, pior, significa falta de foco e/ou pessoas generalistas. Generalistas s&atilde;o bons para darem manuten&ccedil;&atilde;o, mas ruins para constru&iacute;rem do zero por n&atilde;o estarem focadas em boas pr&aacute;ticas da tecnologia. Generalistas podem ser bons l&iacute;deres de projeto se tiverem o devido perfil para tal.</p>
<p align="justify"><strong>O que voc&ecirc; acha das consultorias de inform&aacute;tica?</strong></p>
<p align="justify">Existem dois tipos: consultorias de RH que contratam e alocam profissionais e consultorias de PROJETO, que executam o projeto como terceirizado.</p>
<p align="justify">RH. Cobra caro para achar o profissional, n&atilde;o avalia bem o conhecimento t&eacute;cnico e te manda qualquer um. J&aacute; me mandaram um cara que parecia um travesti, outro que tinha um problema mental (de verdade, ele mesmo me disse) e outro que era estagi&aacute;rio e foi vendido como programador pleno. Trabalhei com v&aacute;rias consultorias de RH.</p>
<p align="justify">Projetos. S&oacute; querem te cobrar muito caro e vender horas, n&atilde;o projetos. Fique atento ao escopo do projeto, voc&ecirc; ter&aacute; problemas se aumentar o escopo e n&atilde;o estiver disposto a pagar mais.</p>
<p align="justify"><strong>Quais s&atilde;o as piores coisas para um programador dentro da empresa?</strong></p>
<ul>
<li>
<p align="justify">Press&atilde;o para entregar um projeto</p>
</li>
<li>
<p align="justify">Gente que n&atilde;o entende nada, mandando e dando opini&atilde;o</p>
</li>
<li>
<p align="justify">Mudan&ccedil;a constante</p>
</li>
<li>
<p align="justify">"Inven&ccedil;&atilde;o de moda"&Acirc;</p>
</li>
<li>
<p align="justify">Trabalhar com gente incompetente</p>
</li>
</ul>
<p align="justify">H&aacute; v&aacute;rios outros, estes s&atilde;o os que vieram &Atilde;?&Acirc;&nbsp; cabe&ccedil;a agora.</p>
<p align="justify"><strong>Por que d&aacute; tanto problema na &aacute;rea de programa&ccedil;&atilde;o da ag&ecirc;ncia?</strong></p>
<p align="justify">A &aacute;rea de desenvolvimento de uma ag&ecirc;ncia &eacute; a mais indom&aacute;vel de todas. Poucas vezes eu vi a parte de cria&ccedil;&atilde;o, reda&ccedil;&atilde;o e arte darem problemas, mas a &aacute;rea de programa&ccedil;&atilde;o &eacute; respons&aacute;vel por mais de 90% das crises de projetos. N&atilde;o &eacute; necessariamente a causa das crises, mas os problemas do projeto sempre se refletem mais fortemente na programa&ccedil;&atilde;o, pois &eacute; uma &aacute;rea extremamente sens&iacute;vel a mudan&ccedil;as, planejamento ruim e atrasos dos outros.</p>
<p align="justify"><strong>O que voc&ecirc; acha de programadores freelancers?</strong></p>
<p align="justify">P&eacute;ssima id&eacute;ia, n&atilde;o tem coisa pior do que isso. Voc&ecirc; tem que dar muita sorte para achar um programador freelancer bom e compromissado. Eu, por exemplo, conhe&ccedil;o somente dois. Tem que procurar muito e constantemente.</p>
<p align="justify"><strong>O meu programador faz trabalho freelancers para outros?</strong></p>
<p align="justify">H&aacute; 99,99% de chances dele fazer.</p>
<p align="justify">"Se ele faz trabalho freelancer, ele levar informa&ccedil;&otilde;es estrat&eacute;gicas da minha empresa!"&Acirc;</p>
<p align="justify">Isso &eacute; verdade, mas dificilmente isso ocorrer&aacute; porque essa id&eacute;ia faz muito mais parte da sua "mente conspirat&oacute;ria"&Acirc; do que da dele. Ele s&oacute; quer uma grana extra. Relax.</p>
<p align="justify"><strong>Se eu brigar com um programador, ele pode querer se vingar e apagar todos os sites ou o bancos de dados?</strong></p>
<p align="justify">Pode ter certeza que isso &eacute; uma das coisas que v&atilde;o passar pela cabe&ccedil;a dele. Voc&ecirc; &eacute; muito inocente se n&atilde;o leva esta situa&ccedil;&atilde;o a s&eacute;rio. Eu j&aacute; isso acontecer mais de uma vez.</p>
<p align="justify"><strong>Por que alguns programadores sempre or&ccedil;am o tempo do projeto errado?</strong></p>
<ul>
<li>
<p align="justify">Ele &eacute; muito j&uacute;nior</p>
</li>
<li>
<p align="justify">Voc&ecirc; muda muita coisa no projeto sem consulta-lo ou exerce muita press&atilde;o. Com isso ele n&atilde;o consegue prever a mudan&ccedil;a com precis&atilde;o</p>
</li>
<li>
<p align="justify">Ele &eacute; realmente um incompetente ou n&atilde;o tem esta habilidade</p>
</li>
</ul>
<p align="justify"><strong>Como um programador pode or&ccedil;ar o tempo de um projeto corretamente?</strong></p>
<p align="justify">A forma mais segura de avaliar o tempo de um projeto &eacute; separa-lo em pequenos m&oacute;dulos (ou entregas) e calcular o tempo de cada m&oacute;dulo para chegar a uma estimativa segura.</p>
<p align="justify">&Atilde;? importante que o escopo do projeto esteja bem detalhado para isso. Fa&ccedil;a isso com um desenvolvedor experiente, evite programadores j&uacute;niores nesta tarefa. A diferen&ccedil;a de avalia&ccedil;&atilde;o de tempo pode variar de acordo com o expertise, confian&ccedil;a e experi&ecirc;ncia do programador.</p>
<p align="justify"><strong>Como saber se a avalia&ccedil;&atilde;o de tempo do projeto &eacute; correta se n&atilde;o entendo de programa&ccedil;&atilde;o?</strong></p>
<p align="justify">Depois que o projeto estiver dividido em m&oacute;dulos, compare com a avalia&ccedil;&atilde;o de tempo de outros m&oacute;dulos em outros projetos e procure incoer&ecirc;ncias.</p>
<p align="justify">Exemplo: um sistema de enquete n&atilde;o pode levar tr&ecirc;s dias para ser feito num projeto e seis dias em outro. Um cadastro simples demora muito menos tempo para ser feito do que um sistema de enquetes. Tendo um hist&oacute;rico de avalia&ccedil;&otilde;es e utilizando bom senso e experi&ecirc;ncia, voc&ecirc; pode fazer um bom julgamento sobre a avalia&ccedil;&atilde;o de tempo no projeto.</p>
<p align="justify"><strong>Por que ele &Atilde;?&Acirc;&nbsp;s vezes fala que precisa de dois dias para uma tarefa e outras vezes a mesma tarefa dura cinco dias?</strong></p>
<p align="justify">Certifique se as tarefas s&atilde;o realmente parecidas. Se forem:</p>
<ul>
<li>
<p align="justify">Ele est&aacute; querendo se proteger do excesso de trabalho</p>
</li>
<li>
<p align="justify">Ele &eacute; muito ruim</p>
</li>
<li>
<p align="justify">Ele est&aacute; te enganando (mais comum)</p>
</li>
</ul>
<p align="justify"><strong>Por que algumas pequenas modifica&ccedil;&otilde;es no projeto demoram tanto?</strong></p>
<p align="justify">Existem projetos complexos ou mal programados onde pequenas modifica&ccedil;&otilde;es s&atilde;o realmente complicadas, mas a experi&ecirc;ncia e o conhecimento do programador podem influenciar este tempo. Isso &eacute; normal.</p>
<p align="justify"><strong>Antes de mandar um programador embora, do que &eacute; bom se certificar?</strong></p>
<ul>
<li>
<p align="justify">Verique se ele possui acesso a dados da empresas, senhas e logins. Mapeie para trocar logo ap&oacute;s a sa&iacute;da dele</p>
</li>
<li>
<p align="justify">Tome cuidado se ele vai levar conhecimento embora. Se ele &eacute; o &uacute;nico que sabe mexer em determinado projeto, voc&ecirc; ter&aacute; problemas em dar manuten&ccedil;&atilde;o neste projeto, pois outro programador ter&aacute; o esfor&ccedil;o de aprender o projeto para come&ccedil;ar a mexer</p>
</li>
<li>
<p align="justify">Verifique a dificuldade em contratar outra pessoa com o mesmo conhecimento para a &aacute;rea</p>
</li>
<li>
<p align="justify">Preveja o impacto destas dificuldades na continuidade de seus projetos</p>
</li>
</ul>
<p align="justify"><strong>O que fazer se o programador da minha empresa &eacute; um folgado?</strong></p>
<p align="justify">Eu conheci muitos programadores realmente folgados, mas a sua empresa contribui muito para isso. Acontece normalmente quando ele &eacute; o &uacute;nico programador ou &eacute; gerenciado por pessoas que n&atilde;o entendem nada de programa&ccedil;&atilde;o e o tratam como se fosse um pasteleiro de feira. Tente identificar o motivo dele ser assim. Na maioria dos casos n&atilde;o tem jeito, tem que mandar ele embora.</p>
<p align="justify"><strong>Sou Atendimento. Se eu entendesse de programa&ccedil;&atilde;o, ou pelo menos me esfor&ccedil;asse, isso iria melhorar o trabalho dos programadores da minha ag&ecirc;ncia?</strong></p>
<p align="justify">Sem d&uacute;vida. Um dos maiores problemas das ag&ecirc;ncias &eacute; que o cara que faz a venda ou lida com o cliente n&atilde;o entende nada do que vai ser programado.</p>
<p align="justify"><strong>Sou Arquiteto de Informa&ccedil;&atilde;o e fa&ccedil;o wireframes na minha ag&ecirc;ncia. Como posso melhorar a vida do programador que vai desenvolver o projeto?</strong></p>
<p align="justify">Valide o wireframe com ele constantemente. Um dos grandes problemas que vejo nas ag&ecirc;ncias &eacute; o fato das pessoas que fazem wireframes n&atilde;o entenderem de programa&ccedil;&atilde;o. Cansei de ver wireframes improgram&aacute;veis porque o AI n&atilde;o tinha conhecimento de programa&ccedil;&atilde;o, apenas vis&atilde;o de usu&aacute;rio.</p>
<p align="justify"><strong>O que vai acontecer se eu acelerar a programa&ccedil;&atilde;o? Botar o programador para fazer uma coisa muito r&aacute;pido?</strong></p>
<p align="justify">Voc&ecirc; vai criar um programador que utiliza <a title=" (Este link abre uma nova janela!)" target="_blank" rel="externo" href="http://desciclo.pedia.ws/wiki/POG">POG</a>.</p>
<p align="justify">Ele vai fazer mal feito e vai te dar muita dor de cabe&ccedil;a quando voc&ecirc; entregar o projeto para o cliente. Isso &eacute; t&atilde;o certo quanto 1 + 1 = 2.</p>
<p align="justify"><strong>O que vai acontecer se eu botar ele pra trabalhar mais que 8 horas por dia, finais de semana e madrugadas?</strong></p>
<p align="justify">Leia a resposta acima.</p>
<p align="justify"><strong>Um hacker fez um estrago no meu site. O meu programador &eacute; culpado?</strong></p>
<p align="justify">N&atilde;o necessariamente, mas a experi&ecirc;ncia dele, tecnologia utilizada e a forma com voc&ecirc; implementa a seguran&ccedil;a do seu servidor podem contribuir significativamente para isso.</p>
<p align="justify">Voc&ecirc; conhece algum projeto que ficou t&atilde;o mal programado por causa da press&atilde;o da ag&ecirc;ncia que trouxe problemas por longos prazos?</p>
<p align="justify">V&aacute;rios. Conhe&ccedil;o gente que est&aacute; chorando h&aacute; muito tempo. J&aacute; vi a coisa ficar muito feia mesmo. O esfor&ccedil;o para fazer bem feito pode te livrar de dores de cabe&ccedil;a grandes.</p>
<p align="justify"><strong>O programador da minha ag&ecirc;ncia n&atilde;o testa o que faz! O que fazer?</strong></p>
<p align="justify">A id&eacute;ia de que um programador pode ser capaz de testar os projetos que faz &eacute; uma lenda. Grave isso: ELE N&Atilde;?O VAI TESTAR! Ou pelo menos vai fazer um teste muito superficial. Solu&ccedil;&atilde;o? Tenha um &aacute;rea de testes.</p>
<p align="justify">Contrate uma pessoa respons&aacute;vel por testar os projetos e criar relat&oacute;rios sobre eles. N&atilde;o &eacute; dif&iacute;cil de se formar uma pessoa assim. E seguindo uma metodologia simples, ele &eacute; capaz de te livrar de 90% das dores de cabe&ccedil;a. A quantidade de defeitos do projeto tem rela&ccedil;&atilde;o direta com experi&ecirc;ncia, press&atilde;o para entregas e mudan&ccedil;as no projeto.</p>
<p align="justify"><strong>E sobre os talentos?</strong></p>
<p align="justify">A diferen&ccedil;a de produtividade entre um cara talentoso e um cara bom pode ser absurda. Saiba quem s&atilde;o os talentosos e invista neles. Se for um trabalho de produ&ccedil;&atilde;o (n&atilde;o criativo), a diferen&ccedil;a de velocidade pode ser 100% ou 200% maior. Acredite.</p>
<p align="justify"><strong>Qual a solu&ccedil;&atilde;o para projetos r&aacute;pidos e a varia&ccedil;&atilde;o de demanda na ag&ecirc;ncia?</strong></p>
<p align="justify">N&atilde;o &eacute; uma f&oacute;rmula simples de resolver, mas &eacute; essencial que se trabalhe com parceria com pequenas e m&eacute;dias empresas. Evite ficar enchendo a ag&ecirc;ncia de programadores, mescle os projetos com parceiros, trabalhe com uns poucos freelancers confi&aacute;veis e mantenha uma equipe mais s&ecirc;nior internamente capaz de gerenciar outras empresas e passar o conhecimento para os mais novos mesclando o trabalho com estes.</p>
<p align="justify">Num projeto normal, acredito que 20% do trabalho pode ser feito com geradores de c&oacute;digo, 30% com programadores j&uacute;niors, 30% com plenos e em 20% do tempo voc&ecirc; realmente precisa de um programador s&ecirc;nior.</p>
<p align="justify">Claro que isso n&atilde;o &eacute; uma regra, mas um projeto n&atilde;o precisa ser 100% constru&iacute;do por programadores s&ecirc;niors para ficar bom. Al&eacute;m disso, a utiliza&ccedil;&atilde;o de programadores j&uacute;niors resolve apenas parte do projeto, ele vai se embananar quando precisar fazer coisas mais complexas e que exigem um pouco mais de conhecimento e experi&ecirc;ncia. <strong>[Webinsider]</strong></p>
<p align="justify" class="sobre"><strong>Sobre o autor</strong></p>
<p align="justify" class="sobre">Marcelo Okano (<a href="mailto:okano@mandic.com.br">okano@mandic.com.br</a>) &eacute; gerente de TI da <a title=" (Este link abre uma nova janela!)" target="_blank" rel="externo" href="http://www.cdn.com.br/">CDN Interativa</a>.</p>
<p><strong><a href="http://webinsider.uol.com.br/index.php/2006/11/22/por-que-e-tao-dificil-encontrar-bons-programadores/">Clique aqui para o artigo original</a></strong> (Depois de receberem milhares de cr&iacute;ticas, retiraram do ar)</div>
</td>
</tr>
</table>
