---
layout: single
status: publish
published: true
title: Devaneio
author:
  display_name: lpicanco
  login: lpicanco
  email: lpicanco@gmail.com
  url: ''
author_login: lpicanco
author_email: lpicanco@gmail.com
wordpress_id: 9
wordpress_url: http://www.luizantonio.com/blog/2006/10/05/desvaneio/
date: '2006-10-05 13:23:07 -0300'
date_gmt: '2006-10-05 16:23:07 -0300'
categories:
- Reflex&Atilde;?&Acirc;&pound;o
tags: []
comments:
- id: 139
  author: Leandro
  author_email: urashima.keitaro@bol.com.br
  author_url: ''
  date: '2006-10-05 10:28:34 -0300'
  date_gmt: '2006-10-05 13:28:34 -0300'
  content: "Mandou bem kra... Eu concordo que sistemas comerciais s&atilde;o uma bosta,
    a bosta &eacute; que preciso deles para viver... Quem mandou eu nascer pobre.
    =(\n \n\n \nMas &eacute; isso a&iacute;, quem aprende a programar para mexer com
    sistemas comerciais &eacute; maluco, programa&ccedil;&atilde;o &eacute; muito
    mais do que isso.\n \n\n \nRevolu&ccedil;&atilde;o J&aacute;!! "
- id: 140
  author: Fernanda
  author_email: nandarabbit@oi.com.br
  author_url: ''
  date: '2006-10-05 11:06:18 -0300'
  date_gmt: '2006-10-05 14:06:18 -0300'
  content: "Agora so falta vc colocar umas fotinhos sua hauahau e aproveita coloca
    o ficap ai na sua lista de projetos eheehe\n \nbjussssssss "
- id: 142
  author: Kerrie Hovorka
  author_email: Kerrie.Kercado@gmail.com
  author_url: http://www.structuredsettlementcompanies.biz
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'I like the theme is it a free one '
- id: 143
  author: Kerrie Felleman
  author_email: Kerrie.Gancio@gmail.com
  author_url: http://www.travelinsurancereviews.biz
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'I feel there exists a issue with your website utilising Flock internet
    browser '
- id: 144
  author: Kerrie Farmwald
  author_email: Kerrie.Garwin@gmail.com
  author_url: http://www.billingcompanies.info
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'Hmm it seems like your blog ate my first comment (it was super long) so
    I guess Ill just sum it up what I submitted and say Im thoroughly enjoying your '
- id: 145
  author: lv shoes
  author_email: Damvelly@ymail.com
  author_url: http://louisvuittonshoessale.info
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: "<a>lv purse</a> income are usually well worth getting rather than trustworthy
    sorts while they help it become a lesser amount of challenging in your case to
    be able to support upwards while using the many newest styles and also results
    in an individual together with satisfactory price range left to get yet another
    bag at the same time! "
- id: 146
  author: Marvella Vanderstappen
  author_email: Sperandeo@gmail.com
  author_url: http://www.appleproduct.net/category/apple-accessories/ipad-accessories/ipad-cases
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'I admire the valuable facts you provide inside your content. I will bookmark
    your weblog and also have my youngsters check up right here frequently. I am fairly
    positive theyll learn lots of new stuff here than anybody else! '
- id: 147
  author: koha ditore
  author_email: Wislocki7448@hotmail.com
  author_url: http://www.mmmts.com/softskill-training/2010/06/15/leadership-%E2%80%93-asking-the-tough-questions/comment-page-1/#comment-35168
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'I''m honored to receive a call coming from a friend immediately he discovered
    the important suggestions shared in your site. Studying your blog write-up is
    a real brilliant experience. Thank you for thinking about readers at all like
    me, and I would like for you the best of achievements as a professional in this
    field. '
- id: 148
  author: Kerrie Kissi
  author_email: Kerrie.Mesecar@gmail.com
  author_url: http://www.whatispos.org
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'For females who encounter similar problems the age is usually later around
    40 to 50 onwards Gelles wrote regarding his work with Suzanne Steinmetz and '
- id: 149
  author: Kerrie Sangasy
  author_email: Kerrie.Grabauskas@gmail.com
  author_url: http://www.amazonpromotionalcode.us
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'Congratulations on having Hands down the most sophisticated blogs Ive
    come throughout using some time Its just incredible how much you can remove from
    one '
- id: 150
  author: Kerrie Pych
  author_email: Kerrie.Moddejonge@gmail.com
  author_url: http://www.fullmoviedownloadfree.com
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'I can maintain informed of your latest posts '
- id: 151
  author: Kerrie Verrone
  author_email: Kerrie.Relles@gmail.com
  author_url: http://www.dancingwiththestarsseason2011.com
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'Excellent post thanks so much for sharing Do you have an RSS feed I can
    subscribe to '
- id: 152
  author: Kerrie Biggard
  author_email: Kerrie.Haggermaker@gmail.com
  author_url: http://www.workplace-accident-compensation-claim.com
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'Alertec is proving clinically useful within the treatment ofnarcolepsy
    a neurological condition marked by uncontrollable attacks of daytimesleepiness
    Order Alertec medicine '
- id: 153
  author: Kerrie Daire
  author_email: Kerrie.Sorokin@gmail.com
  author_url: http://www.home-security-systems-consumer-reports.com
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'Casselberry '
- id: 154
  author: Kerrie Dimon
  author_email: Kerrie.Saft@gmail.com
  author_url: http://www.mobile-phone-deals.biz
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'Hi there can I quote a number of the insight here in this entry if I link
    back to you '
- id: 155
  author: Kerrie Alonza
  author_email: Kerrie.Cheak@gmail.com
  author_url: http://www.contentsinsurancelandlord.com
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'Attractive portion of content I just stumbled upon your weblog and in
    accession capital to say that I acquire in fact loved account your blog posts '
- id: 156
  author: Kerrie Grandchild
  author_email: Kerrie.Bras@gmail.com
  author_url: http://www.racmotoringservices.com
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'I actually absolutely must think much more in that direction and see what
    i can do over it '
- id: 157
  author: Sairosokis
  author_email: gallusikbu@gmail.com
  author_url: http://sairos.okis.ru/
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: "Resultados on-line \n  <a href=\"http://sairos.okis.ru/\" rel=\"nofollow\">http://sairos.okis.ru/</a> "
- id: 158
  author: Kerrie Myntti
  author_email: Kerrie.Suddath@gmail.com
  author_url: http://www.amazon-fire.com
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'Exactly what this indicates is that traceability-exact software applications
    (like HarvestMark and Red Prairie) isnt designed to deal with supporting paper
    documents '
- id: 159
  author: Kerrie Quanstrum
  author_email: Kerrie.Colder@gmail.com
  author_url: http://www.no-win-no-fee-claims.biz
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'I have to say this post was certainly informative and contains useful
    content for enthusiastic visitors I will definitely bookmark this blog for future '
- id: 481
  author: koutsobolia.eu
  author_email: ''
  author_url: http://www.koutsobolia.eu/
  date: '2015-08-17 11:32:50 -0300'
  date_gmt: '2015-08-17 14:32:50 -0300'
  content: |-
    <strong>koutsobolia.eu</strong>

    &Gamma;&iota;&alpha; &nu;&alpha; &mu;&eta;&nu; &mu;&epsilon;&nu;&epsilon;&tau;&epsilon; &alpha;&delta;&iota;&alpha;&beta;&alpha;&sigma;&tau;&omicron;&iota; &sigma;&tau;&eta;&nu; &epsilon;&nu;&eta;&mu;&epsilon;&rho;&omega;&sigma;&eta; , &epsilon;&nu;&eta;&mu;&epsilon;&rho;&omega;&theta;&epsilon;&iota;&tau;&epsilon; &tau;&omega;&rho;&alpha; &gamma;&iota;&alpha; &Zeta;&omega;&delta;&iota;&alpha;. &Beta;&rho;&iota;&sigma;&kappa;&omicron;&upsilon;&mu;&epsilon; &nu;&epsilon;&alpha; &gamma;&iota;&alpha; &nu;&alpha; &sigma;&alpha;&sigmaf; &kappa;&rho;&alpha;&tau;&alpha;&mu;&epsilon; &pi;&alpha;&nu;&tau;&alpha; &epsilon;&nu;&eta;&mu;&epsilon;&rho;&omega;&mu;&epsilon;&nu;&omicron;&upsilon;&sigmaf;
- id: 748
  author: Escrow
  author_email: ''
  author_url: http://coinodeals.com
  date: '2016-06-01 15:26:31 -0300'
  date_gmt: '2016-06-01 18:26:31 -0300'
  content: |-
    <strong>carding</strong>

    I saw this really good post today. Find your required stuff.
---
<p>O devaneio est&aacute; a&iacute;.</p>
<p>A programa&ccedil;&atilde;o parece que se tornou apenas a arte de construir sistemas comerciais. Pessoal vamos viver, vamos construir softwares para symbiam, utilit&aacute;rios para o linux, daemons para processadores da arquitetura ARM, boot loaders etc.</p>
<p>Me lembro de quando pensava na programa&ccedil;&atilde;o como algo para controlar circuitos digitais, complement&aacute;-los. Programa&ccedil;&atilde;o &eacute; uma arte, &eacute; algo que complementa os circuitos digitais.</p>
<p>Os circuitos digitais, hoje em dia, promovem o fen&Atilde;?&Acirc;&acute;meno da internet. Em meados de 1990, quando a computa&ccedil;&atilde;o pessoal ainda engatinhava, os grandes centros de pesquisas como os da Xerox em Palo Alto deslumbravam novas id&eacute;ias para a futuro. O futuro seria digital, tudo poderia ser feito atrav&eacute;s de simples cliques.</p>
<p>Os big players da inform&aacute;tica, hoje em dia, s&atilde;o big players porque investiram em pesquisa b&aacute;sica, na programa&ccedil;&atilde;o de baixo n&iacute;vel e no futuro. N&atilde;o d&aacute; para fazer hist&oacute;ria apenas desenvolvendo sistemas comercias.</p>
<p>Revolu&ccedil;&atilde;o j&aacute;.</p>
