---
layout: post
status: publish
published: true
title: A Evolu&Atilde;?&Acirc;&sect;&Atilde;?&Acirc;&pound;o da Engenharia de Software
author:
  display_name: lpicanco
  login: lpicanco
  email: lpicanco@gmail.com
  url: ''
author_login: lpicanco
author_email: lpicanco@gmail.com
wordpress_id: 67
wordpress_url: http://www.luizantonio.com/2007/10/03/a-evolucao-da-engenharia-de-software/
date: '2007-10-03 20:55:26 -0300'
date_gmt: '2007-10-03 23:55:26 -0300'
categories:
- Reflex&Atilde;?&Acirc;&pound;o
tags: []
comments:
- id: 303
  author: Fernando Hidemi Uchiyama
  author_email: fernandoblogs@yahoo.com.br
  author_url: http://fernandoaprendeflex.awardspace.com
  date: '2007-10-04 00:37:17 -0300'
  date_gmt: '2007-10-04 03:37:17 -0300'
  content: |-
    Aqui no Jap&atilde;o esse conceito de F&aacute;brica de Softwares &eacute; largamente utilizado, na pr&aacute;tica, pelas empresas de desenvolvimento de software (Em geral, um conceito herdado das milhares de f&aacute;bricas que o pa&iacute;s possui em autom&oacute;veis, eletr&Atilde;?&Acirc;&acute;nicos, comida etc).

    As empresas de desenvolvimento possuem centenas de programadores, e cada um &eacute; respons&aacute;vel por desenvolver apenas uma parte do aplicativo, sempre de modo repetitivo.

    Para quem estiver estudando sobre este assunto ou quiser mais informa&ccedil;&otilde;es, recomendo o interc&acirc;mbio com empresas de desenvolvimento de software e de games japonesas, j&aacute; que o estilo ocidental de desenvolvimento de softwares &eacute; totalmente diferente.

    Esse sistema de F&aacute;brica de Software j&aacute; &eacute; implementado e usado no Jap&atilde;o, e funciona.
- id: 304
  author: L&Atilde;?&Acirc;&copy;o Simas
  author_email: edsel@netzenos.com.br
  author_url: http://www.contaouro.com.br
  date: '2007-10-04 09:37:20 -0300'
  date_gmt: '2007-10-04 12:37:20 -0300'
  content: |-
    Esse sistema s&oacute; peca pelo fato de tirar a criatividade da m&atilde;o dos programadores, transformando-os em apertadores de parafusos.
    A empresa ganha em produtividade, mas perde em inova&ccedil;&atilde;o. Que &eacute; justamente um dos pontos fortes de se utilizar um software.
- id: 305
  author: Fernando Hidemi Uchiyama
  author_email: fernandoblogs@yahoo.com.br
  author_url: http://fernandoaprendeflex.awardspace.com
  date: '2007-10-05 01:30:27 -0300'
  date_gmt: '2007-10-05 04:30:27 -0300'
  content: |-
    Nesse sistema a inova&ccedil;&atilde;o n&atilde;o &eacute; feita pelos programadores, mas pelos projetistas. Esse sistema requer projetos sofisticados, tanto de produto como de gerenciamento de pessoal. Al&eacute;m do produto, o fator complicante &eacute; que &eacute; preciso criar um sistema de gerenciamento e de distribui&ccedil;&atilde;o de tarefas, que muitas vezes pode ser mais complicado que o pr&oacute;prio projeto do produto.

    &Atilde;? um processo mais complicado onde o pessoal, que est&aacute; acima dos programadores, precisa conversar muito e se entender e exige muito trabalho em equipe. O pessoa respons&aacute;vel pelo gerenciamento e projeto precisa ser bom tecnicamente e n&atilde;o apenas gerenciadores de recursos humanos.

    Aqui no Jap&atilde;o posso afirmar que tudo isso funciona.
- id: 306
  author: chanel wallet
  author_email: cheghai@gmail.com
  author_url: http://cheapwalletsale1.info
  date: '1999-11-29 21:00:00 -0200'
  date_gmt: '1999-11-30 00:00:00 -0200'
  content: 'From your 20 thirties, <a href="http://discountchanelhandbags1.info" rel="nofollow">chanel
    handbags</a developed the particular in the first place bag which may wait the
    glenohumeral joint shared. '
- id: 458
  author: fragrance alfred sung
  author_email: ''
  author_url: http://fragranceshop.tictail.com/
  date: '2015-07-24 08:10:15 -0300'
  date_gmt: '2015-07-24 11:10:15 -0300'
  content: |-
    <strong>Trackback</strong>

    [...]you make blogging glance[...]
- id: 465
  author: Promote Your Ads
  author_email: ''
  author_url: http://www.promoteyourads.com
  date: '2015-07-29 09:28:30 -0300'
  date_gmt: '2015-07-29 12:28:30 -0300'
  content: |-
    <strong>...Visitor recommendations</strong>

    [...]Wow, wonderful blog layout! How long have you been blogging for?[...]
- id: 596
  author: http://goo.gl/FxqKoe
  author_email: ''
  author_url: http://goo.gl/FxqKoe
  date: '2016-03-11 07:04:20 -0300'
  date_gmt: '2016-03-11 10:04:20 -0300'
  content: |-
    <strong>Biaya Untuk Operasi Kutil</strong>

    }
- id: 599
  author: http://goo.gl/XAdX2K
  author_email: ''
  author_url: http://goo.gl/XAdX2K
  date: '2016-03-16 06:44:22 -0300'
  date_gmt: '2016-03-16 09:44:22 -0300'
  content: |-
    <strong>Cara Menyembuhkan Kutil Pada Kelamin Pria</strong>

    your very own} html coding.
- id: 604
  author: http://mylifewithbeer.blogspot.com/2016/03/obat-daging-tumbuh-di-penis-paling-ampuh.html
  author_email: ''
  author_url: http://ObatDagingTumbuhDiPenisPalingAmpuh
  date: '2016-03-19 00:57:43 -0300'
  date_gmt: '2016-03-19 03:57:43 -0300'
  content: |-
    <strong>Cara Mengobati Daging tumbuh Di Kelamin Dan Cara Mengobati Kutil Di Kelamin</strong>

    Obat Daging Tumbuh Di Penis Paling Ampuh
- id: 636
  author: http://www.abatasa.co.id/jamuherbal
  author_email: ''
  author_url: http://ObatKutilkelamin
  date: '2016-03-25 16:08:20 -0300'
  date_gmt: '2016-03-25 19:08:20 -0300'
  content: |-
    <strong>obat kutil kelamin</strong>

    pengobatn kutil kelamin herbal aman tanpa efek samping hub : 087802956210
- id: 644
  author: http://shirtcrafter.blogspot.com/
  author_email: ''
  author_url: http://CaraMengatasiPenyakitKutilkelamin
  date: '2016-03-30 08:44:46 -0300'
  date_gmt: '2016-03-30 11:44:46 -0300'
  content: |-
    <strong>pengobatn kutil kelamin herbal aman tanpa efek samping hub : 087802956210</strong>

    obat kutil kelamin
- id: 654
  author: http://goo.gl/t6ELut
  author_email: ''
  author_url: http://Apanamaobatsipilis
  date: '2016-04-02 03:22:01 -0300'
  date_gmt: '2016-04-02 06:22:01 -0300'
  content: |-
    <strong>Agen obat herbal resmi untuk berbagai macam penyakit hubungi 081310563770</strong>

    Apa obat penyakit sipilis
- id: 655
  author: http://hargaobatkutilkelaminmurah.wordpress.com/
  author_email: ''
  author_url: http://HargaObatKutilkelaminMurah
  date: '2016-04-02 04:35:15 -0300'
  date_gmt: '2016-04-02 07:35:15 -0300'
  content: |-
    <strong>pengobatn kutil kelamin herbal aman tanpa efek samping hub : 087802956210</strong>

    Harga Obat Kutil kelamin Murah
- id: 674
  author: http://goo.gl/DjBjJ4
  author_email: ''
  author_url: http://apanamaobatkencingnanah
  date: '2016-04-15 17:43:10 -0300'
  date_gmt: '2016-04-15 20:43:10 -0300'
  content: |-
    <strong>apa nama obat kencing nanah</strong>

    Agen obat herbal resmi untuk berbagai macam penyakit hubungi 081310563770
- id: 694
  author: Cara Mengobati Kutil Di Penis
  author_email: ''
  author_url: http://bit.ly/1MXNEEu
  date: '2016-04-27 05:56:45 -0300'
  date_gmt: '2016-04-27 08:56:45 -0300'
  content: |-
    <strong>Di kemaluan anda ada kutil nya..? itu harus di wapadai dan jangan di anggap sepele karena itu adalah kutil kelamin atau jengger ayam atau Kondiloma Akuminata Penyakit Yang Sangat Mudah Menular Ke pasangan Kita. hub:087802956210</strong>

    Cara Mengobati Kutil Di Penis
- id: 699
  author: http://goo.gl/GimbcP
  author_email: ''
  author_url: http://kencingsakitkeluarnanah
  date: '2016-04-27 20:44:34 -0300'
  date_gmt: '2016-04-27 23:44:34 -0300'
  content: |-
    <strong>kencing sakit keluar nanah</strong>

    Kami melayani pemesanan obat herbal untuk segala penyakit seperti: sipilis/raja singa,gonore/kencing nanah, keputihan abnormal, klamidya, kutil kelamin/ jengger ayam, kondiloma akuminata, kanker,diabetes,wasir/ambeien, jantung, stroke, penggemuk badan,&#8230;
- id: 716
  author: kutil
  author_email: ''
  author_url: http://bit.ly/1rJa1np
  date: '2016-05-13 10:25:02 -0300'
  date_gmt: '2016-05-13 13:25:02 -0300'
  content: |-
    <strong>Obat Kutil Kelamin</strong>

    http://bit.ly/1rJa1np
- id: 732
  author: http://goo.gl/L7bn7k
  author_email: ''
  author_url: http://obatkencingsakitkeluarnanahdikelaminpria
  date: '2016-05-24 17:07:28 -0300'
  date_gmt: '2016-05-24 20:07:28 -0300'
  content: |-
    <strong>Obat Kencing Sakit Keluar Nanah Di Kelamin Wanita</strong>

    Kami melayani pemesanan obat herbal untuk segala penyakit seperti: sipilis/raja singa,gonore/kencing nanah, keputihan abnormal, klamidya, kutil kelamin/ jengger ayam, kondiloma akuminata, kanker,diabetes,wasir/ambeien, jantung, stroke, penggemuk badan,&#8230;
- id: 739
  author: Harga obat kencing nanah
  author_email: ''
  author_url: http://bit.ly/1P2WOQK
  date: '2016-05-27 15:53:06 -0300'
  date_gmt: '2016-05-27 18:53:06 -0300'
  content: |-
    <strong>racikan obat sipilis</strong>

    Kami melayani pemesanan obat herbal untuk segala penyakit seperti: sipilis/raja singa,gonore/kencing nanah, keputihan abnormal, klamidya, kutil kelamin/ jengger ayam, kondiloma akuminata, kanker,diabetes,wasir/ambeien, jantung, stroke, penggemuk badan,&#8230;
---
<p><strong>Introdu&ccedil;&atilde;o</strong></p>
<p>Nos &uacute;ltimos anos tem se observado uma crescente movimenta&ccedil;&atilde;o no mercado em torno do modelo de desenvolvimento denominado F&aacute;brica de Software. Esse modelo tem uma grande caracter&iacute;stica que &eacute; o uso de t&eacute;cnicas utilizadas na engenharia industrial de produ&ccedil;&atilde;o em s&eacute;rie, para a cria&ccedil;&atilde;o de um ambiente produtivo de desenvolvimento de software com qualidade e baixo custo.<br />
Esse modelo de desenvolvimento n&atilde;o &eacute; novo, surgiu na d&eacute;cada de 60, mas s&oacute; agora come&ccedil;a a ser intensivamente utilizado pelas empresas de desenvolvimento de software.<br />
Os avan&ccedil;os da engenharia de software nos &uacute;ltimos anos e as mudan&ccedil;as ocorridas nos processos de desenvolvimento de sistemas, como o software livre e o surgimento de padr&otilde;es abertos para desenvolvimento corporativo, fizeram surgir um novo modelo de f&aacute;brica de software no mercado. As novas facilidades tornaram poss&iacute;veis que empresas de m&eacute;dio e at&eacute; de pequeno porte, pudessem montar suas f&aacute;bricas de software para prestar servi&ccedil;os de desenvolvimento de sistemas &Atilde;?&Acirc;&nbsp; crescente terceiriza&ccedil;&atilde;o do mercado, resultando numa prolifera&ccedil;&atilde;o deste novo modelo de f&aacute;brica pelo mundo.</p>
<p><strong>Evolu&ccedil;&atilde;o</strong></p>
<p>Empresas em todo mundo est&atilde;o  percebendo que o desenvolvimento de software &eacute; uma atividade bastante especializada para ser absorvida e custeada internamente. Desta forma &eacute; crescente o n&uacute;mero de terceiriza&ccedil;&atilde;o na &aacute;rea de inform&aacute;tica, especialmente na &aacute;rea de desenvolvimento de software.<br />
Juntamente com esta crescente demanda por terceiriza&ccedil;&atilde;o, cresce tamb&eacute;m o n&iacute;vel de exig&ecirc;ncia do mercado em termos de qualidade e custo do software.  Como resultado, empresas est&atilde;o investindo em ferramentas de automa&ccedil;&atilde;o, enquanto trabalhos de pesquisas em novos paradigmas de implementa&ccedil;&atilde;o, como orienta&ccedil;&atilde;o a aspectos, est&atilde;o obtendo resultados significativos.<br />
Algumas destas pesquisas j&aacute; possuem resultados pr&aacute;ticos, como o AspectJ, uma extens&atilde;o da linguagem Java para  o paradigma orientado a aspectos desenvolvida pelos Institutos de Pesquisa da Xerox. Com a evolu&ccedil;&atilde;o e amadurecimento da orienta&ccedil;&atilde;o a aspectos, ser&aacute; poss&iacute;vel desenvolver software de forma mais consistente, abordando de uma &uacute;nica vez importantes aspectos n&atilde;o-funcionais do sistema, que poder&atilde;o ser reutilizados em v&aacute;rias demandas da f&aacute;brica, eliminando desta forma o retrabalho e a replica&ccedil;&atilde;o de c&oacute;digo.<br />
Segundo Jack Greenfield, importante arquiteto de software da Microsoft, "os m&eacute;todos e pr&aacute;ticas de desenvolvimento de software ter&atilde;o que mudar radicalmente... A solu&ccedil;&atilde;o deve envolver a modifica&ccedil;&atilde;o dos nossos m&eacute;todos e pr&aacute;ticas. Devemos encontrar formas de  tornar os desenvolvedores muito mais produtivos"&Acirc;.<br />
A Microsoft est&aacute; desenvolvendo uma nova arquitetura de desenvolvimento de sistemas denominada "Software Facotories"&Acirc; (F&aacute;bricas de Software).<br />
Segunda a pr&oacute;pria Microsoft ser&aacute; uma arquitetura revolucion&aacute;ria, que elevar&aacute; bastante os n&iacute;veis de reutiliza&ccedil;&atilde;o de software, atrav&eacute;s de conceitos como o de linhas de produ&ccedil;&atilde;o de software, onde componentes poder&atilde;o ser montados, configurados e empacotados, resultando num produto final completo. O desenvolvedor se preocupar&aacute; apenas em  customizar os aspectos altamente especializados e espec&iacute;ficos do projeto.<br />
Um outro t&oacute;pico que ser&aacute; um diferencial no futuro s&atilde;o os significativos avan&ccedil;os das ferramentas case nos &uacute;ltimos anos, que permitir&aacute; a visualiza&ccedil;&atilde;o e controle de todas as fases de desenvolvimento do sistema em uma &uacute;nica ferramenta. Atualmente o n&iacute;vel de integra&ccedil;&atilde;o entre todos os artefatos das v&aacute;rias fases do projeto &eacute; alto,  mas n&atilde;o permite uma automa&ccedil;&atilde;o e rastreabilidade de todos os pontos do sistema. Por&eacute;m num futuro pr&oacute;ximo, com a evolu&ccedil;&atilde;o dos processos de software e das tecnologias de constru&ccedil;&atilde;o de ferramentas case, se espera abranger  todo o sistema, desde a gera&ccedil;&atilde;o do c&oacute;digo &Atilde;?&Acirc;&nbsp; partir dos artefatos de an&aacute;lise e projeto at&eacute; a automa&ccedil;&atilde;o na realiza&ccedil;&atilde;o dos testes.<br />
Com a constante evolu&ccedil;&atilde;o da engenharia de software e das tecnologias envolvidas no desenvolvimento de sistemas, as f&aacute;bricas de software poder&atilde;o vir a ser uma realidade cada vez mais presente no mercado e se tornando cada vez mais efetivas dentro de seu objetivo de produzir software de qualidade em pouco tempo e com baixo custo. Como resultado, espera-se em todo mercado mundial um crescimento ainda maior  na ado&ccedil;&atilde;o do modelo de f&aacute;bricas de software para o desenvolvimento de sistemas.</p>
<p><strong>Conclus&atilde;o</strong></p>
<p>Como pode-se observar a engenharia de software est&aacute; sempre evoluindo. Novos paradigmas, linguagens, ambientes surgem a cada dia, buscando aumentar a produtividade e qualidade no desenvolvimento de software. Sistemas que levavam dois anos para serem codificados hoje em dia podem ser feitos em meses.<br />
O profissional ligado a &aacute;rea de desenvolvimento de software deve ficar atento a esses novos paradigmas, pois se n&atilde;o o fizer, correr&aacute; o risco de tornar-se obsoleto.</p>
